package com.hazz.aipick.base

object Agree {

    val service_for_pay = """
        第一条 导言
        欢迎您使用AI PICK的各项服务！
        本协议是您与AI PICK之间关于您使用AI PICK服务所订立的协议。为保障用户权益，请您在付费之前详细阅读本服务协议所有内容。除非您已阅读并接受本协议所有条款，否则您无权使用AI PICK所有服务。您对本服务的任何购买或接受赠与等获取行为及登录、查看等任何使用行为即视为您已阅读并同意本协议的约束。
        如果您未满18周岁，请在法定监护人的陪同下阅读本协议，并特别注意未成年人使用条款。AI PICK收费内容包括但不限于以下内容：订阅交易员、订阅量化交易机器人 和 市场舆情分析单独购买等。AI PICK官网的现有各类规则,均为本协议不可分割的组成部分，与本协议具有同等法律效力。
        第二条 用户规则
        用户对以其帐号发生的或通过其帐号发生的一切活动和事件（包括但不限于用户发表的任何内容以及由此产生的任何结果）负全部法律责任。
        1、用户在AI PICK有偿获得课程内容或服务时，用户需先登录或注册AI PICK帐号，或通过页面提示选用其他可用帐号进行登录。用户在使用客学院服务时登录的帐号是确认您身份的唯一依据。
        2、用户理解并同意：AI PICK提供有偿内容或服务实行先付款后使用的方式，用户及时、足额、合法的支付所需的款项，是您使用AI PICK有偿内容或服务的前提。
        3、用户理解并同意：AI PICK提供的付费内容产品（交易员订阅、量化交易机器人订阅 和 市场舆情分析订阅）需进行整体一次性购买，购买后可以在产品规定时间内学习该课程所有已发布或即将发布的课程内容。由于购买之内容为均为数字版权内容，故一经购买后，不得申请退款。
        4、用户知悉并同意：用户无权对课程内容进行任何的修改、出租、租赁、出借、出售、分发、复制、创作衍生品。若用户违反本条规定，AI PICK有权视情况采取如下措施：
        4.1 取消用户继续使用该课程的权利；
        4.2 限制/冻结用户的帐号；
        4.3 要求用户退还其通过出售、转让、许可等其他方式取得的收益；
        4.4 其他可以采取的补救措施。
        5、用户了解并同意：AI PICK可能不定期的对收费内容进行更新（包括但不限于：交易员订阅、量化交易机器人订阅 和 市场舆情分析订阅）且无需经过用户的事先同意。
        6、支付宝、微信是用户支付款项的支付平台。用户可以通过AI PICK支付页面提示，选用支付平台账号支付，并承担交易所产生的法律后果。
        7、用户应保管好自己的帐号和密码（包括但不限于：AI PICK帐号和密码、支付平台账号密码），如因用户未保管好自己的帐号和密码而对自己、对AI PICK造成之损害，用户将负全部责任。另外，用户应对用户帐号中的所有活动和事件负全责。用户同意若发现有非法使用用户的帐号或出现安全漏洞的情况，立即通告AI PICK，AI PICK将会尽力予以妥善解决。
        第三条 本协议的修订和变更
        1、本协议内容同时包括AI PICK可能不断发布的关于服务内容的相关协议、业务规则等内容。上述内容一经正式发布，即为本协议不可分割的组成部分，您同样应当遵守。
        2、AI PICK服务协议一旦进行修改，将在页面上公示修改的内容。一经公布即视为通知所有用户。
        3、AI PICK服务所提供的视频、图文等信息，在使用期限中包含AI PICK解决故障、服务器维修、调整、升级等所需用的合理时间，对上述情况所需用的时间AI PICK不予补偿并保留解释权。
        4、AI PICK用户如果不同意条款的修改，可主动向AI PICK提出终止服务申请，但AI PICK不退还自开通服务至提出终止服务所在月的已享受服务的部分费用；如果用户继续享用AI PICK服务，则视为用户已经接受条款的修改。
        第四条 服务的中断和终止
        1、因发生AI PICK不可抗拒的事由，如自然灾害、政府行为、不可抗力，导致服务无法继续，AI PICK会以最快的速度通知用户，但不承担由此造成的任何损失，并不退还用户该阶段的服务费。
        2、如用户违反或被视为违反本服务条款中的内容，AI PICK有权在不用户的情况下立即终止用户已购买的所有服务，以及取用户的AI PICK账户和使用权限，但不退还任何已缴纳的服务费用。
        3、AI PICK未行使或延迟行使其在本协议项下的权利并不构成对这些权利的放弃，而单一或部分行使其在本协议项下的任何权利并不排斥其任何其它权利的行使。AI PICK随时有权要求您继续履行义务并承担相应的违约责任。
        第五条 知识产权
        1、所有权及知识产权：AI PICK官网及APP中包含的任何文字、图表、音频、视频（包括但不限于图表、动画、音频、视频、界面、数据和程序、代码、文档）等信息或材料均受著作权法、商标法和/或其它法律法规的保护。非经AI PICK书面同意任何个人及组织不得擅自使用、修改、复制、传播、改变、散布、发行或发表上述内容。如有违反，必须承担由此造成的一切损失。
        2、用户在AI PICK学习中所产生的评论、答疑、讨论，代码，个人作品（包括但不限于代码，图片，数据等），AI PICK均有权在AI PICK及相关宣传媒体/品进行展示，并无须支付任何费用。
        第六条 法律的适用和管辖
        1、本服务条款的生效、履行、解释及争议的解决均适用中华人民共和国法律，本服务条款因与中华人民共和国现行法律相抵触而导致部分无效，不影响其他部分的效力
        2、若您和AI PICK之间发生任何纠纷或争议，首先应友好协商解决；协商不成的，争议各方一致同意将发生的争议提交协商不成时，任何一方均可向北京市海淀区人民法院提起诉讼
        第七条 其他
        1、AI PICK不行使、未能及时行使或者未充分行使本协议或者按照法律规定所享有的权利，不应被视为放弃该权利，也不影响在将来行使该权利。
        2、本协议条款无论因何种原因部分无效或不可执行，其余条款仍有效，对双方具有约束力
    """.trimIndent()

    val user_agree = """
        一、平台基本守则 AI PICK是以交流投资策略为导向，分享投资策略和投资知识。因此，AI PICK制定了一套平台基本守则，请广大用户知悉。平台信息只是为了给投资提供参考信息，让投资用户在此可以相互学习、分享、互动，并不构成任何投资建议和推荐，投资完全取决于您的个人独立思考和决策，AI PICK并不会对投资的盈利亏损承担任何责任。 
            1. 平台是给交易员和投资人提供交流的平台，以便投资人通过交流、了解选择信任的交易员跟随投资，也方便交易员向投资人分享自己的专业投资知识，以达到相互了解选择跟随投资对象的目的。 
            2. 平台信息可能为AI PICK合作伙伴、金融机构及用户所提供的信息，AI PICK不保证信息的可靠性和真实性，因此，信息发布者只对其发布内容的合法性承担责任，并不会对据此操作的投资所产生的盈利亏损承担任何责任。 
            3. 任何在平台发布信息的行为仅代表其个人，AI PICK设定官方账号对产品技术服务的行为代表AI PICK官方立场。 
        二、平台言论内容规范 AI PICK主要分享投资经验、投资策略、研究及分析行情等相关的金融投资信息，希望平台用户积极发言及分享，并参与讨论相关范围内容。 
        三、言论可信度 AI PICK用户均有发言权，仅代表其个人立场，投资需根据您个人独立思考作出判断和决策。在AI PICK平台中，AI PICK设定的官方账号对AI PICK自身产品、技术相关问题作出的言论代表AI PICK官方立场。 四、版权说明 若出于非商业、非盈利、非广告性目的，任何试图将AI PICK网站平台的内容转载、引用到其他地方，需注明内容原出处。如涉及侵权事宜，版权方可向AI PICK进行投诉，并提供相关证明版权的资料，AI PICK在核实后将会进行处理。
    """.trimIndent()

    val wind_control = """
        本协议是用户与AI PICK之间关于用户使用AI PICK提供的风控服务所订立的协议。本协议描述AI PICK与用户之间关于软件许可及服务使用相关方面的权利义务。
        “用户”或“您”是指享受AI PICK提供的风控服务的个人或单一实体。本服务协议构成您（无论个人或者单位）使用AI PICK所提供的风控服务的先决条件，除非您完全接受本协议的全部条款，否则您无权使用本协议的任何服务。您的使用行为（包括但不限于点击同意、进行下一步操作、支付行为等）将视为同意接受本协议及《AI PICK用户协议》、《AI PICK跟随者/交易员协议》、《AI PICK用户服务协议》各项条款及相关子协议、页面说明或规范流程等全部内容的约束。本协议是由AI PICK上已注册登记并已明确接受此协议的个人或公司共同签署。
        一、服务条款的接受与修改
        1.1AI PICK有权随时对服务条款进行修改，一旦服务条款发生变更，AI PICK将在相关页面上进行公告；您如果不同意条款的修改，可主动向AI PICK提出终止风控服务；您如果继续使用风控服务，则视为已经接受条款的修改。
        1.2设置成功后，我们授予您访问和使用您所设置的风控服务，并安装和使用风控附带软件的权利。本协议中提供相关的详细说明，我们将保留所有其他权利。
        1.3您对产品及内容的使用必须遵循本协议。您不得对产品进行反向工程、反向编译、反汇编或绕过产品技术限制。对于计量您对风控服务使用情况的任何限制机制，您不得禁用、篡改或以其他方式尝试规避。
        1.4您应负责维护与使用风控服务相关的任何非公开身份验证凭证（如登录密码）的保密性。如有任何可能的账户或身份验证凭据的误用或任何与在线服务有关的安全意外行为，您必须立刻通知我们的客户支持团队。您在使用AI PICK所提供的服务时，由于您将个人密码告知他人或与他人共享注册账户而导致的任何个人资料泄露，从而遭受任何人身或财务的损失、损害或伤害，AI PICK均不承担负任何责任。
        1.5AI PICK对用户协议一旦进行修改，将在页面上公示修改的内容。一经公布即视为通知用户。
        1.6您的服务使用期限包含AI PICK解决故障、服务器维修、调整、升级等所需用的合理时间，对上述情况所需用的时间AI PICK不予补偿并保留解释权。
        二、服务使用
        2.1AI PICK用户服务涉及的AI PICK产品/服务的所有权以及相关软件知识产权归AI PICK所有。AI PICK授予您一项个人的、非独家的、不可转让的许可，即您仅享有AI PICK产品/服务和软件的有限使用权。AI PICK所提供的服务将按照其服务条款和操作规则严格执行。本协议视为《AI PICK用户协议》、《AI PICK跟随者/交易员协议》、《AI PICK用户服务协议》的补充协议，是其不可分割的一部分。您在享受AI PICK任何单项服务时，应当受本协议以及《AI PICK用户协议》、《AI PICK跟随者/交易员协议》、《AI PICK用户服务协议》，包括相关子协议、页面说明或规范流程等内容的约束。本协议如与《AI PICK用户协议》、《AI PICK跟随者/交易员协议》、《AI PICK用户服务协议》发生冲突，以本协议为准；本协议未尽事宜，以《AI PICK用户协议》、《AI PICK跟随者/交易员协议》、《AIPICK用户服务协议》中的约定为准。
        2.2您应对自身在使用AI PICK所提供的服务时的一切行为（无论是否故意）负全部责任。AI PICK享有对您在AI PICK及其关联公司提供的服务平台上的一切活动的监督、提示、检查的权利，如您的行为违反有关法律法规或违反本协议条款的约定，AI PICK享有要求其纠正及追究其责任等权利。
        2.3AI PICK向您提供的全部服务，均仅限于用户在AI PICK平台使用，任何以恶意破解等非法手段将AI PICK提供的服务内容与AI PICK平台分离的行为，均不属于本协议中约定的AI PICK提供的服务。由此引起的一切法律后果由行为人负责，与AI PICK无关，且AI PICK将依法追究行为人的法律责任。
        2.4当您使用AI PICK各单项服务时，则视为您对各单项服务的服务条款以及AI PICK在该单项服务中发出各类公告、页面说明或规范流程等的同意。
        2.5您应自行负责妥善且正确地保管、使用、维护您在AI PICK申请取得的账户、账户信息及账户密码。您应对您账户信息和账户密码采取必要和有效的保密措施，非AI PICK原因致使您账户密码泄漏以及因您保管、使用、维护不当造成损失的，AI PICK无须承担与此有关的任何责任。
        2.6AI PICK不对您因第三方的行为或不作为造成的损失承担任何责任，包括但不限于支付服务和网络接入服务、任意第三方的侵权行为或其他违法违规行为。
        三、服务设置
        3.1净值保护功能
        3.1.1AI PICK提供了净值保护功能，该功能将根据您设置的值和您的账户净值情况，决定是否关闭您的所有正在持仓的订单，以保护您的账户资金。
        3.1.2您一旦设置了净值保护的值并执行包含但不限于“点击‘下一步’”等操作导致保存成功，即视为您已开启使用净值保护功能且同意《AI PICK账户风控协议》。
        3.1.3保护期间，一旦您的账户净值小于设置的净值保护的值，将会触发保护操作流程，包括但不限于关闭所有正在持仓的订单、暂停所有跟随关系、关闭净值保护开关功能等操作。如果您需要再次使用净值保护功能，需要重新设置净值保护的值并保存成功。
        3.1.4您设置的净值保护的值仅可输入数字，且最多输入两位小数；
        3.1.5为避免过快达到保护值对您的账户造成风险，您设置净值保护的值最大仅可输入当前账户净值90%，超过当前账户净值90%，将无法为您保存。
        3.1.6当您账户的净值为0时，净值保护将不可设置，即无法使用净值保护功能。
        3.2跟随持仓总手数
        3.2.1AI PICK提供了跟随持仓总手数限制功能，该功能将计算您的跟随订单总标准手数。依据开仓时间，当最后一笔订单手数超过该限制时，将拒绝执行这张订单的开仓请求，以保护您的跟随安全。
        3.2.2跟随持仓总手数仅可输入数字，且最多输入两位小数。当与针对交易员设置的最大跟随手数发生冲突时，当跟随开仓手数小于交易员最大跟随手数，但超过跟随持仓总手数时，拒绝开仓；当跟随开仓手数大于交易员最大跟随手数，拒绝开仓；仅当跟随开仓手数小于交易员最大跟随手数，且不超过跟随持仓总手数时，执行跟随开仓请求。
        3.3最大单笔跟随手数
        3.3.1AI PICK提供了最大单笔跟随手数限制功能，该功能将根据您所设置的值对比每一笔跟随订单的开仓手数。当跟随订单开仓手数超过设置的最大单笔跟随手数时，将拒绝执行开仓请求。
        3.3.2最大单笔跟随手数仅可输入数字，且最多输入两位小数。
        3.4您若在使用风控服务过程中修改密码，导致信号丢失，造成风控策略执行失败，AI PICK将停止当前风控服务，信号恢复前，无法建立新的风控服务。
        3.5您将风控功能的设置值删除或修改为0并保存成功，即视为结束风控服务。
        四、服务的中断和终止
        4.1因发生AI PICK不可抗拒的事由，如政府行为、不可抗力，导致用户服务无法继续，AI PICK会以最快的速度通知您，但不承担由此对您造成的任何损失。
        4.2如您违反或被视为违反本服务条款中的内容，AI PICK有权在不通知您的情况下立即终止您已使用的所有服务，以及取消您的AI PICK用户账户和使用权限。
        4.3AI PICK未行使或延迟行使其在本协议项下的权利并不构成对这些权利的放弃，而单一或部分行使其在本协议项下的任何权利并不排斥其任何其它权利的行使。AI PICK随时有权要求您继续履行义务并承担相应的违约责任。
    """.trimIndent()

    val secret_agree =
    """感谢您选择深圳市牛一科技发展有限公司(以下简称“牛一科技”)为您提供的RQPro标准版客户端。牛一科技希望成为每一个宽客(Quant)的专业重化交易平台，我们将直致力于不断完善我们的系统，使您能够获得安全、极速的网络服务；但也请您了解，由于技术及其它不可抗力的原因，我们提供的各项服务也存在各种风险，由此敬请您在了解各项风险的基础上。在使用本软件时，依据您本人的独立思考和判断自主发出交易指令，并请您同意当以下情况之一发生时，对我们服务提供者免于追究责任：您清楚地知道：牛一科技不保证各栏目的功能不含有缺陷或不发生中断、延迟等情况，也不保证支持牛一科技的服务器、信息传输系统不受病毒或其他软硬件故障的影响。您了解并同意，牛一科技可能因公司、其他合作方或相关电信部门的互联网软硬件设备故障或失灵或人为操作疏忽而全部或部分中断、延迟、遗漏、误导或造成资料传输、储存上的错误或遵第三方侵入系统篡改或伪造变造资料等，您若因此遭受损失(包括但不限于资料传输故障或储存错误、第三方或病毒侵入您的系统等)，牛一科技不承担任何责任。
您清楚地知道：本软件中为研究之目的提供的同化金融模型，及利用相关模型获得的已有策略/交易的[风险/收益]的展示，乃依据特定数学公式计算所得结果，并非牛一科技投资建议：同时，过往表现并不能保证未来的业绩;提供用于说明目的的图表和图形可能反映假设历史业绩或历史回溯测算结果；推出日期前提交的所有信息为历史回溯试算而非完全真实表现，不保证未来业绩。以上信息仅供交易参考，据此入市，盈亏自负。
为了使你获取财经资讯，本软件中含第三方的信息，包括但不限于：包括历史行情数据、交易数据、财务数据、实时情报等，牛一科技无法审核每条信息发布内容的真伪。本平台上的信息可能来自于交易所、上市公司、投资研究机构、媒体和用户。牛一科技不保证接收的来自第三方信息源的信息的及时性、准确性、完整性和有效性，此类信息仅供参考，您可通过其他软件或渠道对相关信息进行核查。您根据各种信息进行的交易行为，盈亏自负。
您清楚地知道：由于交易所交易规则所限，软件中包括但不限于各种自助和预设触发条件的下单功能所发生的交易委托不一定能够成交。同时委托交易的数据传输可能因通讯繁忙或丢包等原因出现中断、停顿、延迟、数据错误、丢失或不完全，造成交易出现延迟、停顿、中断，从而会发生您不能及时、完整完成交易的风险。或由于出现网络故障或网络繁忙或交易网关负载过重，或因受到网络黑客、网络病毒的攻击和入侵等原因，软件可能会出现故障，您可能不能及时进入或通过该系统进行正常交易，或接到错误信息，或不能使用软件提供的全部或部分功能。鉴于上述风险的存在，您在使用本软件的时候，应当使用其它信息系统或其它交易手段进行验证，并及时查证成交情况。
您应自行承担各类密码之保密、安全使用等全部责任。为了您的资料和资产安全，您在使用本软件时，如果一日内连续输错密码的次数累计到一定标准，牛一科技有权暂时冻结您的交易。连续输错密码的次数以牛一科技的电脑系统记录为准。您因本人原因泄露密码导致其他人未经授权使用或尝试使用本软件可能遭受的任何损失与牛一科技无关。
您针对本软件的下载、安装、使用、账号登录等行为将视为接受本《声明》，并同意本声明的各项相关条款。
本声明的最终解释权归牛一科技。
"""
}